{
  "active": "🟢 Activo",
  "authorize": "Para descargar las canciones que te gustan de Spotify, primero debes autorizar el bot para acceder a tu cuenta de Spotify.\n\n[🔗 Haz click aquí para autorizar]($1)",
  "debug_starting_bot": "Arrancando SpotDl-Bot (v$1)",
  "donate": "Este proyecto es de código abierto y lo realizo en mi tiempo libre. La donación no habilitará ninguna función extra. Es simplemente, una forma ideal de agradecer el trabajo que un proyecto como éste lleva detrás.\nSi deseas hacerlo, [haz click aquí](https://donate.mralexsaavedra.com).\nMil gracias ❤️",
  "download_completed": "✅ La descarga se ha completado correctamente.",
  "download_url": "🔗 Introduce la URL de Spotify de la canción, album, artista o playlist que quieras descargar.",
  "downloading": "⏳ Descargando...",
  "error_bot_spotify_client_id": "Se necesita configurar el clientId de Spotify con la variable SPOTIFY_CLIENT_ID",
  "error_bot_spotify_client_secret": "Se necesita configurar el clientSecret de Spotify con la variable SPOTIFY_CLIENT_SECRET",
  "error_bot_spotify_redirect_uri": "Se necesita configurar el redirectUri de Spotify con la variable SPOTIFY_REDIRECT_URI",
  "error_bot_telegram_admin": "Se necesita configurar el chatId del usuario que interactuará con el bot con la variable TELEGRAM_ADMIN",
  "error_bot_token": "Se necesita configurar el token del bot con la variable TELEGRAM_TOKEN",
  "error_download": "❌ No se ha podido completar la descarga. Consulta los logs del bot para mayor información.",
  "error_multiple_admin_only_with_group": "Solo se pueden especificar varios administradores si se usa en un grupo (utilizando la variable TELEGRAM_GROUP)",
  "error_no_token": "❌ No se ha encontrado un token válido. Por favor, autoriza al bot para acceder a tu cuenta de Spotify.",
  "error_sending_message": "No se ha podido enviar el mensaje a $1: $2. Error: [$3]",
  "error_unknown_command": "❓ No entiendo el comando. Revisa los comandos disponibles en el menu principal.",
  "menu_authorize": "Autoriza al bot a acceder a tu cuenta de Spotify",
  "menu_donate": "Dona al desarrollador",
  "menu_download_liked_songs": "Descargar canciones guardadas",
  "menu_download": "Descargar",
  "menu_start": "Menú principal",
  "menu_version": "Muestra la versión actual",
  "menu": "*🎙️ SpotDl Bot: Descarga tus canciones, albumnes, artistas o playlists de Spotify.*\n\nComandos disponibles:\n\n · /authorize Autoriza a este bot a tener acceso a Spotify para poder descargar las caciones que te gustas o sincronizar tus playlists.\n · /download Descarga una canción, album, artista o playlist mediante una URL de Spotify.\n · /download_liked_songs Descarga las canciones que te gustan de Spotify.\n · /version Muestra la versión actual.\n · /donate Dona al desarrollador.\n\nℹ️ También puedes poner directamente una URL de Spotify de esa canción, album, artista o playlist que quieras descargar.",
  "not_spotify_url": "❌ La URL introducida no es una URL de Spotify válida. Por favor, introduce una URL de Spotify.",
  "redirect_url": "⬇️ Ahora, por favor, pega el 'code' que aparece en la URL a la que has sido redirigido.",
  "version": "⚙️ _Versión: $1_\nDesarrollado con ❤️ por @mralexsaavedra\n\nSi encuentras cualquier fallo o sugerencia contáctame.\n\nPuedes encontrar todo lo relacionado con este bot en [DockerHub](https://hub.docker.com/r/mralexsaavedra/spotdl-bot) o en [GitHub](https://github.com/mralexsaavedra/spotdl-bot)."
}